xrun(64): 23.09-s003: (c) Copyright 1995-2023 Cadence Design Systems, Inc.
TOOL:	xrun(64)	23.09-s003: Started on Feb 03, 2024 at 21:58:15 -03
xrun
	tb.sv
	I2S.sv
	-gui
	-access +rw
	-input 1waves.tcl
	-input restore.tcl
Recompiling... reason: file './I2S_Transmitter.sv' is newer than expected.
	expected: Sat Feb  3 21:54:07 2024
	actual:   Sat Feb  3 21:57:43 2024
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		tb
	initial begin $readmemh("Wave.txt",ROM_Data); end
	                                          |
xmelab: *W,MEMODR (./I2S.sv,16|43): $readmem default memory order incompatible with IEEE1364.
	Building instance overlay tables: .................... Done
	initial begin $readmemh("Wave.txt",ROM_Data); end
	                                          |
xmelab: *W,MEMODR (./I2S.sv,16|43): $readmem default memory order incompatible with IEEE1364.
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		              Instances  Unique
		Modules:              3       3
		Registers:           31      31
		Scalar wires:        17       -
		Vectored wires:       1       -
		Always blocks:        7       7
		Initial blocks:       2       2
		Pseudo assignments:  11       -
		Process Clocks:       2       2
	Writing initial simulation snapshot: worklib.tb:sv
xmsim: *W,NOMTDGUI: Multi-Threaded Dumping is disabled for interactive debug mode.
xmsim: *E,IONOEN: file does not exist, restore.tcl.

-------------------------------------
Relinquished control to SimVision...
xcelium> 
xcelium> source /Tools/cadence/XCELIUM2309/tools/xcelium/files/xmsimrc
xcelium> base -open waves -into waves.shm -default
xmsim: *E,TCLERR: invalid command name "base".
xcelium> probe -create -shm U1.transmitterU1.* -waveform
xmsim: *SE,DBOBBD: Cannot create SHM probe for tb.U1.transmitterU1.WIDTH.
Created default SHM database xcelium.shm
Created probe 1
xcelium> probe -create -shm U1.* -waveform
xmsim: *SE,DBOBBD: Cannot create SHM probe for tb.U1.RATIO.
xmsim: *SE,DBOBBD: Cannot create SHM probe for tb.U1.WIDTH.
Created probe 2
xcelium> reset
Loaded snapshot worklib.tb:sv
xcelium> run
xmsim: *W,RMEMAR: $readmem warning: address incremented out of range. Too many data words read
	at line 202 of file "Wave.txt". Current address: 201, address range: [0:200].
            File: ./I2S.sv, line = 16, pos = 43
           Scope: tb.U1
            Time: 0 FS + 0

Simulation complete via $finish(1) at time 10001 NS + 0
./tb.sv:10 		#10000 $finish;
xcelium> 
xcelium> ^C
xcelium> exit
...Regained control from SimVision
-------------------------------------
TOOL:	xrun(64)	23.09-s003: Exiting on Feb 06, 2024 at 21:14:53 -03  (total: 71:16:38)
